import { Typography } from "@material-tailwind/react";
import { YMaps, Map, Placemark } from "@pbe/react-yandex-maps";
import Form from "../ui/form";

export default function About() {
  return (
    <section className="mx-auto h-full w-full max-w-[1280px] py-10 px-4 2xl:px-0 space-y-10">
      <div className="w-full flex flex-row flex-wrap justify-center gap-y-10 gap-x-10 xl:justify-between items-center">
        <div className="sm:w-1/4 w-full min-w-[250px] h-[230px] p-7 bg-white rounded-xl flex flex-col items-center justify-between">
          <svg
            width="61"
            height="61"
            viewBox="0 0 61 61"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <g clipPath="url(#clip0_39_363)">
              <path
                d="M30.5 61C30.5 61 53.375 39.3221 53.375 22.875C53.375 16.8082 50.965 10.9898 46.6751 6.69993C42.3852 2.41004 36.5668 0 30.5 0C24.4332 0 18.6148 2.41004 14.3249 6.69993C10.035 10.9898 7.625 16.8082 7.625 22.875C7.625 39.3221 30.5 61 30.5 61ZM30.5 34.3125C27.4666 34.3125 24.5574 33.1075 22.4125 30.9625C20.2675 28.8176 19.0625 25.9084 19.0625 22.875C19.0625 19.8416 20.2675 16.9324 22.4125 14.7875C24.5574 12.6425 27.4666 11.4375 30.5 11.4375C33.5334 11.4375 36.4426 12.6425 38.5875 14.7875C40.7325 16.9324 41.9375 19.8416 41.9375 22.875C41.9375 25.9084 40.7325 28.8176 38.5875 30.9625C36.4426 33.1075 33.5334 34.3125 30.5 34.3125Z"
                fill="#148B8A"
              />
            </g>
            <defs>
              <clipPath id="clip0_39_363">
                <rect width="61" height="61" fill="white" />
              </clipPath>
            </defs>
          </svg>
          <Typography as={"h5"} className="font-primary font-normal text-lg">
            Офис
          </Typography>
          <Typography
            as={"h5"}
            href="https://yandex.ru/maps/-/CDUnJN9D"
            className="font-primary font-light text-gray-600 text-md text-center hover:text-[#148B8A] cursor-pointer"
          >
            г.Ростов-на-Дону, ул. Социалистическая 150, офис 3.
          </Typography>
        </div>
        <div className="sm:w-1/4 w-full min-w-[250px] p-7 h-[230px] bg-white rounded-xl flex flex-col items-center justify-between">
          <svg
            width="61"
            height="61"
            viewBox="0 0 61 61"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <path
              fillRule="evenodd"
              clipRule="evenodd"
              d="M17.7923 6.98959C13.6876 6.98959 9.9758 8.01548 7.28166 10.5172C4.56198 13.0426 3.17773 16.7929 3.17773 21.6042V39.3958C3.17773 44.2072 4.56198 47.9574 7.28166 50.4828C9.9758 52.9846 13.6876 54.0104 17.7923 54.0104H43.209C47.3138 54.0104 51.0256 52.9846 53.7195 50.4828C56.4394 47.9574 57.8236 44.2072 57.8236 39.3958V21.6042C57.8236 16.7929 56.4394 13.0426 53.7195 10.5172C51.0256 8.01548 47.3138 6.98959 43.209 6.98959H17.7923ZM48.8731 21.2542C49.706 20.6105 49.8595 19.4133 49.2157 18.5802C48.5722 17.7472 47.375 17.5937 46.5419 18.2374L32.443 29.1316C31.299 30.0158 29.7021 30.0158 28.5578 29.1316L14.4592 18.2374C13.6261 17.5937 12.4289 17.7472 11.7852 18.5802C11.1415 19.4133 11.295 20.6105 12.1281 21.2542L26.2268 32.1485C28.7441 34.0934 32.2569 34.0934 34.7742 32.1485L48.8731 21.2542Z"
              fill="#148B8A"
            />
          </svg>
          <Typography as={"h5"} className="font-primary font-normal text-lg">
            Контакты
          </Typography>
          <Typography
            as={"h5"}
            className="font-primary font-light text-gray-600 text-md text-center"
          >
            <Typography
              as="a"
              href="tel:89281831222"
              className="font-primary text-gray-600 transition duration-200 hover:text-[#148B8A]"
            >
              8 928 183 1222
            </Typography>
            <Typography
              as="a"
              href="mailto:tovesta-k@yandex.ru"
              className="font-primary text-gray-600 transition duration-200 hover:text-[#148B8A]"
            >
              tovesta-k@yandex.ru
            </Typography>
          </Typography>
        </div>
        <div className="sm:w-1/4 w-full min-w-[250px] h-[230px] p-7 bg-white rounded-xl flex flex-col items-center justify-between">
          <svg
            width="61"
            height="61"
            viewBox="0 0 61 61"
            fill="none"
            xmlns="http://www.w3.org/2000/svg"
          >
            <g clipPath="url(#clip0_35_259)">
              <path
                d="M37.4636 40.9263L30.8145 37.865L27.6203 35.1712L22.5116 40.2528L24.7144 54.9794C24.7222 55.0307 24.7092 55.083 24.6787 55.1247L22.3484 58.3141C22.3113 58.3651 22.2521 58.3949 22.1891 58.3949C22.1262 58.3949 22.067 58.3648 22.0299 58.3141L19.6996 55.1247C19.6691 55.083 19.6562 55.0306 19.664 54.9794L21.8668 40.2525L16.7581 35.1713L13.564 37.8653L6.91492 40.9263C5.93099 41.3299 4.9752 41.9379 4.47246 43.0101C4.47246 43.0101 -2.75473 60.2171 1.16519 60.2171H43.2135C47.1334 60.2171 39.9063 43.0101 39.9063 43.0101C39.4779 41.986 38.4476 41.3299 37.4636 40.9263Z"
                fill="#148B8A"
              />
              <path
                d="M22.1889 35.074C28.9891 35.074 34.0638 28.7381 34.1795 18.1128C34.2534 10.7398 30.742 6.32714 22.1889 6.32714C13.6357 6.32714 10.1238 10.7397 10.1984 18.1128C10.3139 28.7381 15.3885 35.074 22.1889 35.074Z"
                fill="#148B8A"
              />
              <path
                d="M45.3465 0.783035C40.317 0.783035 35.8345 3.16791 32.9688 6.86538C33.2652 7.1082 33.5488 7.36444 33.8177 7.63593C34.3491 8.17272 34.8188 8.76473 35.2339 9.40473C37.4625 6.20974 41.1642 4.11489 45.3465 4.11489C52.1413 4.11489 57.6691 9.64295 57.6691 16.4377C57.6691 23.2324 52.1412 28.7603 45.3465 28.7603C41.9421 28.7603 38.856 27.3724 36.6236 25.133C36.3264 26.3566 35.9494 27.5132 35.4947 28.5935C38.1871 30.7797 41.6162 32.0919 45.3465 32.0919C53.9784 32.0919 61.0009 25.0693 61.0009 16.4376C61.001 7.80565 53.9785 0.783035 45.3465 0.783035Z"
                fill="#148B8A"
              />
              <path
                d="M45.3452 6.45887C44.6551 6.45887 44.0957 7.01814 44.0957 7.70836V16.8708C44.0957 17.5608 44.6551 18.1202 45.3452 18.1202H52.6085C53.2986 18.1202 53.858 17.5608 53.858 16.8708C53.858 16.1807 53.2986 15.6213 52.6085 15.6213H46.5946V7.70836C46.5946 7.01814 46.0352 6.45887 45.3452 6.45887Z"
                fill="#148B8A"
              />
            </g>
            <defs>
              <clipPath id="clip0_35_259">
                <rect width="61" height="61" fill="white" />
              </clipPath>
            </defs>
          </svg>
          <Typography
            as={"h5"}
            className="font-primary font-normal text-lg text-center"
          >
            Режим работы
          </Typography>
          <Typography
            as={"h5"}
            className="font-primary font-light text-gray-600 text-md min-h-[52px] text-center"
          >
            Будни с 9.00 до 18.00
          </Typography>
        </div>
      </div>
      <div className="w-full h-fit bg-white rounded-xl py-8 px-8 md:px-20">
        <Typography
          as="h3"
          className="w-full text-center font-primary font-normal text-xl"
        >
          Прайс-лист
        </Typography>
        <div className="w-full flex justify-center">
          <hr className="border-2 w-1/4 md:w-1/12 max-w-[76px] mt-1 mb-5 md:mb-10 border-[#148B8A]"></hr>
        </div>
        <Typography className="w-full text-center font-primary font-light text-md">
          Не бывает двух одинаковых проектов, цена для каждого индивидуальна и
          зависит от
        </Typography>
        <div className="py-10 md:py-14  flex flex-row flex-wrap justify-center items-center xl:justify-between gap-10">
          <div className="flex flex-col gap-4 lg:gap-6 items-center w-[85px] lg:w-auto">
            <svg
              width="61"
              height="61"
              viewBox="0 0 61 61"
              fill=""
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M30.5006 5.08334C16.4961 5.08334 5.08398 16.4954 5.08398 30.5C5.08398 44.5046 16.4961 55.9167 30.5006 55.9167C44.5052 55.9167 55.9173 44.5046 55.9173 30.5C55.9173 16.4954 44.5052 5.08334 30.5006 5.08334ZM41.5569 39.5738C41.2011 40.1838 40.5656 40.5142 39.9048 40.5142C39.5744 40.5142 39.244 40.4379 38.939 40.2346L31.0598 35.5325C29.1027 34.3633 27.654 31.7963 27.654 29.5342V19.1133C27.654 18.0713 28.5182 17.2071 29.5602 17.2071C30.6023 17.2071 31.4665 18.0713 31.4665 19.1133V29.5342C31.4665 30.4492 32.229 31.7963 33.0169 32.2538L40.8961 36.9558C41.8111 37.4896 42.1161 38.6588 41.5569 39.5738Z"
                fill="#148B8A"
              />
            </svg>

            <Typography
              className="font-primary text-base
font-normal text-center"
            >
              Времени работ
            </Typography>
          </div>
          <div className="flex flex-col gap-4 lg:gap-6 items-center w-[85px] lg:w-auto">
            <svg
              width="61"
              height="61"
              viewBox="0 0 61 61"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M41.1502 5.08334H19.8511C10.5994 5.08334 5.08398 10.5988 5.08398 19.8504V41.1496C5.08398 50.4013 10.5994 55.9167 19.8511 55.9167H41.1502C50.4019 55.9167 55.9173 50.4013 55.9173 41.1496V19.8504C55.9173 10.5988 50.4019 5.08334 41.1502 5.08334ZM25.3411 37.8708L19.6223 43.5896C19.2411 43.9708 18.7582 44.1488 18.2752 44.1488C17.7923 44.1488 17.284 43.9708 16.9282 43.5896L15.0219 41.6833C14.2594 40.9463 14.2594 39.7263 15.0219 38.9892C15.759 38.2521 16.9536 38.2521 17.7161 38.9892L18.2752 39.5483L22.6469 35.1767C23.384 34.4396 24.5786 34.4396 25.3411 35.1767C26.0781 35.9138 26.0781 37.1338 25.3411 37.8708ZM25.3411 20.0792L19.6223 25.7979C19.2411 26.1792 18.7582 26.3571 18.2752 26.3571C17.7923 26.3571 17.284 26.1792 16.9282 25.7979L15.0219 23.8917C14.2594 23.1546 14.2594 21.9346 15.0219 21.1975C15.759 20.4604 16.9536 20.4604 17.7161 21.1975L18.2752 21.7567L22.6469 17.385C23.384 16.6479 24.5786 16.6479 25.3411 17.385C26.0781 18.1221 26.0781 19.3421 25.3411 20.0792ZM44.6323 42.2425H31.2886C30.2465 42.2425 29.3823 41.3783 29.3823 40.3363C29.3823 39.2942 30.2465 38.43 31.2886 38.43H44.6323C45.6998 38.43 46.5386 39.2942 46.5386 40.3363C46.5386 41.3783 45.6998 42.2425 44.6323 42.2425ZM44.6323 24.4508H31.2886C30.2465 24.4508 29.3823 23.5867 29.3823 22.5446C29.3823 21.5025 30.2465 20.6383 31.2886 20.6383H44.6323C45.6998 20.6383 46.5386 21.5025 46.5386 22.5446C46.5386 23.5867 45.6998 24.4508 44.6323 24.4508Z"
                fill="#148B8A"
              />
            </svg>

            <Typography
              className="font-primary text-base
font-normal text-center"
            >
              Выявленных задач
            </Typography>
          </div>
          <div className="flex flex-col gap-4 lg:gap-6 items-center w-[85px] lg:w-auto">
            <svg
              width="61"
              height="61"
              viewBox="0 0 61 61"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M22.8757 5.08334C16.2165 5.08334 10.8027 10.4971 10.8027 17.1563C10.8027 23.6883 15.9115 28.975 22.5707 29.2038C22.774 29.1783 22.9773 29.1783 23.1298 29.2038C23.1807 29.2038 23.2061 29.2038 23.2569 29.2038C23.2823 29.2038 23.2823 29.2038 23.3077 29.2038C29.8144 28.975 34.9231 23.6883 34.9486 17.1563C34.9486 10.4971 29.5348 5.08334 22.8757 5.08334Z"
                fill="#148B8A"
              />
              <path
                d="M35.7893 35.9618C28.698 31.2343 17.1335 31.2343 9.99146 35.9618C6.76354 38.1222 4.98438 41.0451 4.98438 44.1714C4.98438 47.2976 6.76354 50.1951 9.96604 52.3301C13.5244 54.7193 18.201 55.9139 22.8777 55.9139C27.5543 55.9139 32.2309 54.7193 35.7893 52.3301C38.9918 50.1697 40.7709 47.2722 40.7709 44.1205C40.7455 40.9943 38.9918 38.0968 35.7893 35.9618Z"
                fill="#148B8A"
              />
              <path
                d="M50.8063 18.6511C51.213 23.582 47.7055 27.9027 42.8509 28.4872C42.8255 28.4872 42.8255 28.4872 42.8001 28.4872H42.7238C42.5713 28.4872 42.4188 28.4872 42.2917 28.5381C39.8263 28.6652 37.5642 27.8772 35.8613 26.4285C38.4792 24.0903 39.9788 20.5828 39.6738 16.7703C39.4959 14.7115 38.7842 12.8307 37.7167 11.2295C38.6826 10.7465 39.8009 10.4415 40.9447 10.3399C45.9263 9.90779 50.3742 13.6186 50.8063 18.6511Z"
                fill="#148B8A"
              />
              <path
                d="M55.8861 42.1673C55.6827 44.6327 54.1069 46.7677 51.4636 48.2164C48.9219 49.6143 45.7194 50.2752 42.5423 50.1989C44.3723 48.5469 45.4398 46.4881 45.6431 44.3023C45.8973 41.1506 44.3977 38.126 41.3986 35.7114C39.6956 34.3644 37.7132 33.2969 35.5527 32.5089C41.1698 30.8823 48.2356 31.9752 52.5819 35.4827C54.9202 37.3635 56.1148 39.7273 55.8861 42.1673Z"
                fill="#148B8A"
              />
            </svg>

            <Typography
              className="font-primary text-base
font-normal text-center"
            >
              Количества участников
            </Typography>
          </div>
          <div className="flex flex-col gap-4 lg:gap-6 items-center w-[85px] lg:w-auto">
            <svg
              width="61"
              height="61"
              viewBox="0 0 61 61"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M53.3496 24.6796C52.4854 24.3238 51.3417 24.1458 49.9183 24.1458H36.4983C32.0758 24.1458 30.5 25.7217 30.5 30.195V49.8675C30.5 51.3417 30.6779 52.4854 31.0592 53.375C31.8471 55.205 33.5246 55.9167 36.4983 55.9167H49.9183C54.3408 55.9167 55.9167 54.3154 55.9167 49.8675V30.195C55.9167 27.1704 55.205 25.4675 53.3496 24.6796ZM45.75 50.1979H40.6667C40.6158 50.1979 40.5396 50.1979 40.4888 50.1725C40.1075 50.1471 39.7771 50.02 39.4975 49.7658C39.04 49.4354 38.7604 48.9017 38.7604 48.2917C38.7604 47.2496 39.6246 46.3854 40.6667 46.3854H45.75C46.7921 46.3854 47.6562 47.2496 47.6562 48.2917C47.6562 49.3338 46.7921 50.1979 45.75 50.1979Z"
                fill="#148B8A"
              />
              <path
                d="M53.3483 15.7329V17.7917C53.3483 19.1896 52.2046 20.3333 50.8067 20.3333H36.4971C29.9904 20.3333 26.6862 23.6629 26.6862 30.195V53.375C26.6862 54.7729 25.5425 55.9167 24.1445 55.9167H19.1883C18.1716 55.9167 17.3583 55.1033 17.3583 54.1121C17.3583 53.0954 18.1716 52.3075 19.1883 52.3075H24.1445V42.5729H15.2487C9.60617 42.2933 5.10742 37.6421 5.10742 31.9233V15.7329C5.10742 9.86168 9.88576 5.08334 15.7824 5.08334H42.6988C48.57 5.08334 53.3483 9.86168 53.3483 15.7329Z"
                fill="#148B8A"
              />
            </svg>

            <Typography
              className="font-primary text-base
font-normal text-center"
            >
              Формата проведения
            </Typography>
          </div>
          <div className="flex flex-col gap-4 lg:gap-6 items-center w-[85px] lg:w-auto">
            <svg
              width="61"
              height="61"
              viewBox="0 0 61 61"
              fill="none"
              xmlns="http://www.w3.org/2000/svg"
            >
              <path
                d="M36.4723 5.08334H24.5264C21.8831 5.08334 19.7227 7.21834 19.7227 9.86168V12.2508C19.7227 14.8942 21.8577 17.0292 24.501 17.0292H36.4723C39.1157 17.0292 41.2506 14.8942 41.2506 12.2508V9.86168C41.2761 7.21834 39.1157 5.08334 36.4723 5.08334Z"
                fill="#148B8A"
              />
              <path
                d="M43.8157 12.2495C43.8157 16.2908 40.5116 19.5949 36.4703 19.5949H24.5244C20.4831 19.5949 17.179 16.2908 17.179 12.2495C17.179 10.8262 15.654 9.93661 14.3831 10.5974C10.7994 12.5037 8.35938 16.2908 8.35938 20.637V44.5541C8.35938 50.8066 13.4681 55.9154 19.7206 55.9154H41.2741C47.5266 55.9154 52.6353 50.8066 52.6353 44.5541V20.637C52.6353 16.2908 50.1953 12.5037 46.6116 10.5974C45.3407 9.93661 43.8157 10.8262 43.8157 12.2495ZM31.4632 43.08H20.3306C19.2885 43.08 18.4244 42.2158 18.4244 41.1737C18.4244 40.1316 19.2885 39.2675 20.3306 39.2675H31.4632C32.5053 39.2675 33.3695 40.1316 33.3695 41.1737C33.3695 42.2158 32.5053 43.08 31.4632 43.08ZM38.1224 32.9133H20.3306C19.2885 32.9133 18.4244 32.0491 18.4244 31.0071C18.4244 29.965 19.2885 29.1008 20.3306 29.1008H38.1224C39.1645 29.1008 40.0286 29.965 40.0286 31.0071C40.0286 32.0491 39.1645 32.9133 38.1224 32.9133Z"
                fill="#148B8A"
              />
            </svg>

            <Typography
              className="font-primary text-base
font-normal text-center"
            >
              Объема сопровождения
            </Typography>
          </div>
        </div>
      </div>
      <div className="w-full p-8 md:px-20 bg-white rounded-xl">
        <Typography
          as="h3"
          className="w-full text-center font-primary font-normal text-xl"
        >
          Обратная связь
        </Typography>
        <div className="w-full flex justify-center">
          <hr className="border-2 w-1/4 md:w-1/12 max-w-[76px] mt-1 mb-5 md:mb-10 border-[#148B8A]"></hr>
        </div>
        <Typography className="w-full text-center font-primary font-light text-md">
          Если у Вас есть вопросы или предложения вы можете отправить в форме
          обратной связи
        </Typography>
        <Form />
      </div>
      <div className="w-full py-8 px-8 md:px-20 h-fit bg-white rounded-xl">
        <Typography
          as="h3"
          className="w-full text-center font-primary font-normal text-xl"
        >
          Интерактивная карта
        </Typography>
        <div className="w-full flex justify-center">
          <hr className="border-2 w-1/4 md:w-1/12 max-w-[76px] mt-1 mb-5 md:mb-10 border-[#148B8A]"></hr>
        </div>
        <YMaps query={{ apikey: "3393c833-d9af-455e-aeac-c97893c9816d" }}>
          <div className="rounded-xl overflow-clip">
            <Map
              className="w-full h-[500px]"
              defaultState={{
                center: [47.223357, 39.729763],
                zoom: 18,
              }}
            >
              <Placemark geometry={[47.223357, 39.729763]} />
            </Map>
          </div>
        </YMaps>
      </div>
    </section>
  );
}
