import { Typography } from "@material-tailwind/react";

export default function Fifth() {
  return (
    <Typography as="div">
      <Typography as={"p"} className="font-primary font-light">
        Юридическая поддержка в госзакупках нужна, в первую очередь, для
        собственной безопасности. Заказчики часто хитрят при составлении
        договорных отношений с Подрядчиком или просто надеются на их
        невнимательность. Это чревато самым страшным для участника закупок –
        РНП! За неисполнение или недобросовестное исполнение своих обязательств
        Подрядчик может попасть в реестр недобросовестных организаций.
        <br />
        <br /> Это будет означать только одно - работа через тендеры на
        несколько лет прекратится.
        <br /> <br />
        Именно во избежание подобных ситуаций нужно крайне внимательно
        относиться к условиям исполнения контракта. На этапе подготовки к
        участию есть возможность согласовать с Заказчиком некоторые нюансы
        условий договора – и мы поможем Вам это сделать! А также поможем
        отстоять Ваши интересы в Арбитражных спорах.
        <br /> <br />
      </Typography>
      <Typography
        as="h3"
        className="font-bold font-primary text-[#148B8A] text-lg"
      >
        Ведение дел по защите от включения в реестр недобросовестных поставщиков
        по 44-ФЗ и по 223-ФЗ
      </Typography>
      <br />
      <Typography as={"p"} className="font-primary font-light">
        Мы ведем дела по защите от внесения в реестр недобросовестных
        поставщиков (РНП) и помогаем нашим клиентам в самых сложных случаях.
        Попадание в РНП несет весьма негативные последствия, которые могут
        сказаться на деятельности компании. К таким последствиям можно отнести
        лишение на 2 года возможности участвовать в тендерах и зарабатывать на
        них, испорченная репутация компании для контрагентов, испорченная
        репутация учредителей и директора. С недавнего времени сведения об
        учредителях и директоре компании также заносятся в реестр
        недобросовестных поставщиков.
        <br />
        <br /> Благодаря умению работать с несовершенством законодательства и
        правовыми коллизиями, специалисты компании «Веста-К» успешно защищают
        интересы своих клиентов и «вытаскивают», казалось бы, безнадежные дела.
        <br /> <br />
      </Typography>
      <Typography
        as="h3"
        className="font-bold font-primary text-[#148B8A] text-lg"
      >
        Досудебная претензионная работа по заключенному контракту
      </Typography>
      <br />
      <Typography as={"p"} className="font-primary font-light">
        В рамках данного направления деятельности компания «Веста-К» решает
        проблемы, возникающие между контрагентами по заключенному контракту.
        <br />
        <br /> С проблемами сталкивается практически каждый исполнитель
        контракта, они могут быть связаны с непредоставлением надлежащей
        технической документацией, отсутствием представителя заказчика на
        объекте, недопуском рабочих на объект, препятствованием работам, отказом
        от приемки товара или частичной приемкой, претензиями к оказанным
        услугам, результатам работ, претензиями к порядку и способу выполнения
        работ, наложением необоснованных штрафов.
        <br /> <br />
      </Typography>
    </Typography>
  );
}
