const sliderContent = [
  {
    img: "/images/sliderBackground/1(1).jpeg",
    title:
      "Профессиональный консалтинг в сфере госзакупок – с нами проще построить эффективный бизнес",
    description: [
      "Сорудники нашей компании имеют опыт работы более 15 лет.",
      "Работая с нашей командой, Вы будете развивать свой бизнес!",
    ],
  },
  {
    img: "/images/sliderBackground/1(2).jpeg",
    title: "Чем мы лучше конкурентов?",
    description: [
      "Мы работаем со сложными заказчиками",
      "В нашей команде работают только профессионалы",
      "У нас гибкая система ценообразования - вы платите только за те услуги, которые действительно вам нужны",
      "Гарантируем безопасность ваших данных",
    ],
  },
  {
    img: "/images/sliderBackground/1(3).jpeg",
    title:
      "Ваш бизнес связан с госзакупками, и Вы хотите увеличить обороты? Мы можем и готовы предложить взаимовыгодные условия!",
    description: [
      "Направьте в наш адрес Ваше предложение",
      "Дождитесь звонка нашего специалиста",
      "Подпишите договор сотрудничества",
      "Наращивайте обороты своего бизнеса!",
    ],
  },
];
export default sliderContent;
