const textAboutCompany = ['ООО «Веста-К» является одной из лидирующих компаний в области организации и проведения торгов, работающей на рынке свыше 4 лет, с высоким уровнем качества, современным менеджментом и подходом к ведению бизнеса.
Организация оказывает полный комплекс услуг по проведению торгов на размещение заказов для государственных и муниципальных нужд, в том числе:
- разрабатывает полный комплект тендерной документации, включая техническое задание и проект контракта;
- оказывает содействие при определении Заказчиком начальной (максимальной) цены Государственного контракта;
- осуществляет подготовку, публикацию и размещение извещений о проведении торгов и итогах проведения торгов в официальном печатном издании субъекта и на официальном сайте субъекта Российской Федерации;
- обеспечивает своевременное размещение тендерной документации на официальном сайте субъекта Российской Федерации и, по отдельному поручению, на сайте Заказчика;
- по запросу Заказчика оказывает консультационно-методические услуги по вопросам размещения заказа на поставку товара, выполнение работ, оказание услуг для государственных и муниципальных нужд;
- обеспечивает предоставление сведений участникам торгов об условиях и порядке проведения торгов, дает разъяснения положений тендерной документации;
- представляет интересы Заказчика в ФАС России и в Судебных органах при обжаловании проводимых совместно торгов;
- производит экспертизу ранее проведенных торгов;
- осуществляет всестороннюю проверку участников торгов с выдачей аналитических заключений и многое другое.
ООО «Веста-К» строит свой бизнес, основываясь на принципах строжайшего соблюдения законодательства, максимального удовлетворения потребностей заказчика и создания добросовестной конкуренции.
ООО «Веста-К» имеет квалифицированных специалистов, прошедших обучение в лучших учебных учреждениях страны, специализирующихся на повышении квалификации в области государственных закупок.
ООО «Веста-К» имеет высококвалифицированных специалистов, прошедших обучение по курсу: «Управление государственными и муниципальными заказами» в лучших учебных заведениях Российской Федерации.
В настоящее время специалисты ООО «Веста-К» уже сами являются преподавателями Южного федерального университета (ЮФУ) и Пилотного центра ЮФУ, привлекаются органами исполнительной власти к разработке научно-методической документации для концепции электронного развития города Ростова-на-Дону в качестве экспертов при нормотворческой деятельности в области размещения государственного и муниципального заказа.
']